erwinquilloy/MLRS-GCS-Bridge/mlrs_gcs_esp32_v2/mlrs_gcs_esp32_v2.ino
//*******************************************************
// mLRS GCS Bridge - generic ESP32 (no OLED)
//
// Port of mlrs_gcs_heltec_v2 with all SSD1306/OLED code
// removed. Status and telemetry are printed to the USB
// serial monitor instead. Otherwise functionally identical:
// ESP-NOW + WiFi UDP link layers, runtime-toggleable via
// the onboard BOOT/PRG button (GPIO0), mode persisted to
// NVS, MAVLink HEARTBEAT presence ping in UDP mode.
//
// Default mode on fresh flash: WiFi UDP.
//
// Forwards MAVLink to MFD Mini Crossbow via Serial2 TX
// (GPIO17 by default; see TX_PIN).
//
// No external libraries required - core only.
//
// Board: Tools -> Board -> ESP32 Arduino -> ESP32 Dev Module
//        (or whichever generic ESP32 dev board you're using)
// ESP32 Arduino core >= 3.0.0
//
// License: GPL v3
//*******************************************************

#include <WiFi.h>
#include <WiFiUdp.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_system.h>
#include <Preferences.h>

// Forward declaration so Arduino's auto-generated function prototypes -
// inserted between the #includes and the first function definition - can
// reference MavPacket before its full definition appears further down.
struct MavPacket;

//-------------------------------------------------------
// USER CONFIGURATION
//-------------------------------------------------------

// UDP mode only: set to match your Nomad's WiFi Bridge.
// SSID is generated from the Tx MAC as "mLRS-xxxx AP UDP".
// UDP mode has no password by default; leave blank unless set.
#define WIFI_SSID       ""
#define WIFI_PASS       ""
#define UDP_PORT        14550

#define CROSSBOW_BAUD   115200
#define TX_PIN          17     // GPIO17 -> Crossbow MAVLink input

#define STATUS_UPDATE_MS  2000  // Serial telemetry/status print cadence

#define PRG_PIN         0      // Onboard BOOT/PRG button (active LOW)
#define SPLASH_MS       2500   // Hold PRG this long during boot to toggle mode

WiFiUDP   udp;
Preferences prefs;


//-------------------------------------------------------
// Mode selection
//-------------------------------------------------------

enum Mode : uint8_t { MODE_UDP = 0, MODE_ESPNOW = 1 };
Mode current_mode = MODE_UDP;

const char* mode_str(Mode m) {
    return (m == MODE_UDP) ? "WiFi UDP" : "ESP-NOW";
}


//-------------------------------------------------------
// Boot reason helpers (diagnostic)
//-------------------------------------------------------

const char* reset_reason_str(esp_reset_reason_t r) {
    switch (r) {
        case ESP_RST_POWERON:   return "POWERON";
        case ESP_RST_EXT:       return "EXT (RST pin)";
        case ESP_RST_SW:        return "SW (esp_restart)";
        case ESP_RST_PANIC:     return "PANIC (Guru Meditation)";
        case ESP_RST_INT_WDT:   return "INT_WDT";
        case ESP_RST_TASK_WDT:  return "TASK_WDT";
        case ESP_RST_WDT:       return "WDT (other)";
        case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "UNKNOWN";
    }
}


//-------------------------------------------------------
// Minimal MAVLink parser (no library needed)
//-------------------------------------------------------

#define MAVLINK_MSG_ID_HEARTBEAT            0
#define MAVLINK_MSG_ID_SYS_STATUS           1
#define MAVLINK_MSG_ID_GPS_RAW_INT          24
#define MAVLINK_MSG_ID_GLOBAL_POSITION_INT  33
#define MAVLINK_MSG_ID_RADIO_STATUS         109

struct MavPacket {
    bool     valid;
    uint8_t  version;
    uint32_t msg_id;
    uint8_t  payload[280];
    uint8_t  payload_len;
};

// Explicit prototypes so Arduino's auto-prototype generator (which inserts
// prototypes near the top of the .ino, sometimes above the MavPacket
// forward declaration) doesn't try to synthesise its own broken ones for
// these functions.
bool mav_parse_byte(uint8_t c, MavPacket& pkt);
void process_mavlink_packet(MavPacket& pkt);

// MAVLink CRC-16 (X.25), used to build our presence-ping HEARTBEAT.
inline uint16_t mav_crc_accumulate(uint8_t data, uint16_t crc) {
    uint8_t tmp = data ^ (uint8_t)(crc & 0xff);
    tmp ^= (tmp << 4);
    return ((crc >> 8) ^ ((uint16_t)tmp << 8) ^ ((uint16_t)tmp << 3) ^ ((uint16_t)tmp >> 4));
}

// Build a MAVLink v1 HEARTBEAT from a GCS endpoint. Returns packet length.
// sys_id=255, comp_id=190 is the conventional GCS identity (Mission Planner).
int build_gcs_heartbeat(uint8_t* out, uint8_t seq) {
    out[0] = 0xFE;        // STX (MAVLink v1)
    out[1] = 9;           // payload length
    out[2] = seq;         // sequence
    out[3] = 255;         // sys_id (GCS)
    out[4] = 190;         // comp_id (MISSION_PLANNER)
    out[5] = 0;           // msg_id = HEARTBEAT
    // payload: u32 custom_mode, u8 type, u8 autopilot, u8 base_mode,
    //          u8 system_status, u8 mavlink_version
    out[6]  = 0; out[7] = 0; out[8] = 0; out[9] = 0;  // custom_mode = 0
    out[10] = 6;          // type = MAV_TYPE_GCS
    out[11] = 8;          // autopilot = MAV_AUTOPILOT_INVALID
    out[12] = 0;          // base_mode
    out[13] = 4;          // system_status = MAV_STATE_ACTIVE
    out[14] = 3;          // mavlink_version
    // CRC over [LEN..end of payload] + HEARTBEAT crc_extra (50)
    uint16_t crc = 0xFFFF;
    for (int i = 1; i < 15; i++) crc = mav_crc_accumulate(out[i], crc);
    crc = mav_crc_accumulate(50, crc);   // HEARTBEAT crc_extra
    out[15] = (uint8_t)(crc & 0xff);
    out[16] = (uint8_t)(crc >> 8);
    return 17;
}

enum MavParseState { WAIT_STX, IN_HEADER, IN_PAYLOAD, IN_CRC };

static MavParseState parse_state = WAIT_STX;
static uint8_t  parse_buf[300];
static int      parse_idx  = 0;
static int      parse_len  = 0;
static int      header_len = 0;
static uint8_t  parse_ver  = 0;

int32_t  mav_get_i32(const uint8_t* p, int o) {
    return (int32_t)(p[o] | (p[o+1]<<8) | (p[o+2]<<16) | (p[o+3]<<24));
}
uint32_t mav_get_u32(const uint8_t* p, int o) {
    return (uint32_t)(p[o] | (p[o+1]<<8) | (p[o+2]<<16) | (p[o+3]<<24));
}
uint16_t mav_get_u16(const uint8_t* p, int o) {
    return (uint16_t)(p[o] | (p[o+1]<<8));
}

bool mav_parse_byte(uint8_t c, MavPacket& pkt) {
    switch (parse_state) {
        case WAIT_STX:
            if (c == 0xFE) {
                parse_ver = 1; header_len = 6;
                parse_buf[0] = c; parse_idx = 1;
                parse_state = IN_HEADER;
            } else if (c == 0xFD) {
                parse_ver = 2; header_len = 10;
                parse_buf[0] = c; parse_idx = 1;
                parse_state = IN_HEADER;
            }
            break;
        case IN_HEADER:
            parse_buf[parse_idx++] = c;
            if (parse_idx >= header_len) {
                parse_len = parse_buf[1];
                parse_state = IN_PAYLOAD;
            }
            break;
        case IN_PAYLOAD:
            parse_buf[parse_idx++] = c;
            if (parse_idx >= header_len + parse_len)
                parse_state = IN_CRC;
            break;
        case IN_CRC:
            parse_buf[parse_idx++] = c;
            if (parse_idx >= header_len + parse_len + 2) {
                pkt.valid       = true;
                pkt.version     = parse_ver;
                pkt.payload_len = parse_len;
                if (parse_ver == 1) {
                    pkt.msg_id = parse_buf[5];
                    memcpy(pkt.payload, &parse_buf[6], parse_len);
                } else {
                    pkt.msg_id = parse_buf[7] | (parse_buf[8]<<8) | (parse_buf[9]<<16);
                    memcpy(pkt.payload, &parse_buf[10], parse_len);
                }
                parse_state = WAIT_STX;
                parse_idx   = 0;
                return true;
            }
            break;
        default:
            parse_state = WAIT_STX;
            parse_idx   = 0;
            break;
    }
    if (parse_idx >= (int)sizeof(parse_buf)) {
        parse_state = WAIT_STX;
        parse_idx   = 0;
    }
    return false;
}


//-------------------------------------------------------
// Telemetry data + decoding
//-------------------------------------------------------

float     telem_lat         = 0.0f;
float     telem_lon         = 0.0f;
float     telem_alt_m       = 0.0f;
float     telem_spd_ms      = 0.0f;
float     telem_hdg_deg     = 0.0f;
int       telem_satellites  = 0;
uint8_t   telem_fix         = 0;
float     telem_bat_v       = 0.0f;
int       telem_bat_pct     = -1;
int       telem_rssi_pct    = -1;
uint32_t  telem_flight_mode = 0;
bool      telem_armed       = false;
bool      telem_gps_ok      = false;
bool      telem_ever_data   = false;
unsigned long telem_last_ms = 0;

enum FwType { FW_UNKNOWN, FW_ARDU, FW_INAV };
FwType    fw_type           = FW_UNKNOWN;
const char* fw_label        = "?";

const char* get_mode_str_ardu(uint32_t mode) {
    switch (mode) {
        case 0:  return "MANUAL";
        case 1:  return "CIRCLE";
        case 2:  return "STAB";
        case 5:  return "FBWA";
        case 6:  return "FBWB";
        case 7:  return "CRUISE";
        case 10: return "AUTO";
        case 11: return "RTL";
        case 12: return "LOITER";
        case 15: return "GUIDED";
        case 26: return "CRSH";
        default: return "---";
    }
}

const char* get_mode_str_inav(uint32_t mode) {
    switch (mode) {
        case 0:  return "ANGLE";
        case 1:  return "HORIZON";
        case 2:  return "ACRO";
        case 3:  return "MANUAL";
        case 4:  return "ALTHOLD";
        case 5:  return "POSHOLD";
        case 6:  return "HEADFRE";
        case 7:  return "NAVRTH";
        case 8:  return "NAVWP";
        case 9:  return "NAVCRSH";
        case 10: return "NAVPH";
        case 11: return "COURSE";
        case 12: return "AUTOTRN";
        case 17: return "LAUNCH";
        case 19: return "HOMING";
        default: return "---";
    }
}

const char* get_mode_str(uint32_t mode) {
    if (fw_type == FW_INAV) return get_mode_str_inav(mode);
    return get_mode_str_ardu(mode);
}

void process_mavlink_packet(MavPacket& pkt) {
    const uint8_t* p = pkt.payload;
    switch (pkt.msg_id) {
        case MAVLINK_MSG_ID_GLOBAL_POSITION_INT:
            if (pkt.payload_len >= 28) {
                telem_lat   = (float)mav_get_i32(p, 4)  / 1e7f;
                telem_lon   = (float)mav_get_i32(p, 8)  / 1e7f;
                telem_alt_m = (float)mav_get_i32(p, 16) / 1000.0f;
                int16_t vx  = (int16_t)mav_get_u16(p, 20);
                int16_t vy  = (int16_t)mav_get_u16(p, 22);
                telem_spd_ms = sqrtf((float)(vx*vx + vy*vy)) / 100.0f;
                uint16_t h  = mav_get_u16(p, 26);
                if (h != 65535) telem_hdg_deg = h / 100.0f;
                telem_gps_ok = true;
            }
            break;
        case MAVLINK_MSG_ID_GPS_RAW_INT:
            if (pkt.payload_len >= 30) {
                telem_fix        = p[28];
                telem_satellites = p[29];
            }
            break;
        case MAVLINK_MSG_ID_SYS_STATUS:
            if (pkt.payload_len >= 31) {
                telem_bat_v   = (float)mav_get_u16(p, 14) / 1000.0f;
                telem_bat_pct = (int8_t)p[30];
            }
            break;
        case MAVLINK_MSG_ID_RADIO_STATUS:
            if (pkt.payload_len >= 5) {
                uint8_t raw = p[4];
                telem_rssi_pct = (raw == 255) ? -1 : (int)constrain(raw, 0, 100);
            }
            break;
        case MAVLINK_MSG_ID_HEARTBEAT:
            if (pkt.payload_len >= 7) {
                uint8_t mav_type   = p[4];
                uint8_t autopilot  = p[5];
                uint8_t base_mode  = p[6];
                if (fw_type == FW_UNKNOWN) {
                    if (autopilot == 12)      { fw_type = FW_INAV; fw_label = "iNAV"; }
                    else if (autopilot == 3)  { fw_type = FW_ARDU; fw_label = "ARDU"; }
                }
                if (mav_type == 1 || mav_type == 2 || mav_type == 3 ||
                    mav_type == 13 || mav_type == 19) {
                    telem_flight_mode = mav_get_u32(p, 0);
                    telem_armed = (base_mode & 0x80) != 0;
                }
            }
            break;
    }
    telem_ever_data = true;
    telem_last_ms   = millis();
}


//-------------------------------------------------------
// Serial status print (replaces OLED HUD)
//-------------------------------------------------------

void serial_status(const char* l1, const char* l2 = "") {
    Serial.printf("[mLRS %s] %s", mode_str(current_mode), l1);
    if (l2 && l2[0]) Serial.printf(" | %s", l2);
    Serial.println();
}

void serial_telem() {
    bool data_active = (millis() - telem_last_ms < 2000);
    const char* link =
        data_active ? "LINK OK" : (telem_ever_data ? "NO DATA" : "waiting");

