erwinquilloy/MLRS-GCS-Bridge/mlrs_gcs_esp32_v2/mlrs_gcs_esp32_v2.ino
    Serial.printf("[telem] %-6s %s sats=%d fw=%s ",
        get_mode_str(telem_flight_mode),
        telem_armed ? "ARM" : "dis",
        telem_satellites,
        fw_label);

    if (telem_gps_ok) {
        Serial.printf("lat=%.6f lon=%.6f ", telem_lat, telem_lon);
    } else {
        Serial.printf("fix=%dD ", telem_fix);
    }

    Serial.printf("alt=%.0fm gs=%.0f hdg=%d ",
        telem_alt_m, telem_spd_ms, (int)telem_hdg_deg);

    if (telem_bat_pct >= 0)
        Serial.printf("bat=%.1fV %d%% ", telem_bat_v, telem_bat_pct);
    else
        Serial.printf("bat=%.1fV ", telem_bat_v);

    if (telem_rssi_pct >= 0)
        Serial.printf("rssi=%d%% %s\n", telem_rssi_pct, link);
    else
        Serial.printf("rssi=--- %s\n", link);
}


//-------------------------------------------------------
// ESP-NOW state
//-------------------------------------------------------

#define ESPNOW_RXBUF_SIZE  2048
uint8_t espnow_rxbuf[ESPNOW_RXBUF_SIZE];
volatile uint16_t espnow_rxbuf_head = 0;
volatile uint16_t espnow_rxbuf_tail = 0;

volatile bool espnow_latched_mac_available = false;
uint8_t espnow_latched_mac[6];
bool    latched_peer_added = false;

uint8_t broadcast_mac[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
const uint8_t scan_channels[] = { 1, 6, 11, 13 };

void espnow_rxbuf_push(const uint8_t* data, int len) {
    for (int i = 0; i < len; i++) {
        uint16_t next = (espnow_rxbuf_head + 1) & (ESPNOW_RXBUF_SIZE - 1);
        if (next == espnow_rxbuf_tail) break;
        espnow_rxbuf[espnow_rxbuf_head] = data[i];
        espnow_rxbuf_head = next;
    }
}

int espnow_rxbuf_pop(uint8_t* dst, int maxlen) {
    int cnt = 0;
    while (espnow_rxbuf_tail != espnow_rxbuf_head && cnt < maxlen) {
        dst[cnt++] = espnow_rxbuf[espnow_rxbuf_tail];
        espnow_rxbuf_tail = (espnow_rxbuf_tail + 1) & (ESPNOW_RXBUF_SIZE - 1);
    }
    return cnt;
}

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void espnow_recv_cb(const esp_now_recv_info_t* info, const uint8_t* data, int len)
{
    const uint8_t* sender_mac = info->src_addr;
#else
void espnow_recv_cb(const uint8_t* mac, const uint8_t* data, int len)
{
    const uint8_t* sender_mac = mac;
#endif
    if (!espnow_latched_mac_available) {
        memcpy(espnow_latched_mac, sender_mac, 6);
        espnow_latched_mac_available = true;
    } else if (memcmp(sender_mac, espnow_latched_mac, 6) != 0) {
        return;
    }
    espnow_rxbuf_push(data, len);
}


//-------------------------------------------------------
// UDP state
//-------------------------------------------------------

bool      udp_peer_latched = false;
IPAddress udp_peer_ip;
uint16_t  udp_peer_port    = 0;


//-------------------------------------------------------
// Shared link state
//-------------------------------------------------------

bool          is_connected          = false;
unsigned long is_connected_tlast_ms = 0;
bool          link_initialized      = false;
uint8_t       buf[1024];


//-------------------------------------------------------
// ESP-NOW bring-up + channel scan
//-------------------------------------------------------

void scan_for_bridge(void) {
    if (espnow_latched_mac_available) {
        esp_now_del_peer(espnow_latched_mac);
        espnow_latched_mac_available = false;
        latched_peer_added = false;
    }

    serial_status("Scanning for", "mLRS bridge...");

    while (true) {
        for (int i = 0; i < (int)sizeof(scan_channels); i++) {
            esp_wifi_set_channel(scan_channels[i], WIFI_SECOND_CHAN_NONE);

            char ch_str[20];
            snprintf(ch_str, sizeof(ch_str), "Channel %d...", scan_channels[i]);
            serial_status("Scanning...", ch_str);

            unsigned long t = millis();
            while (millis() - t < 500) {
                while (Serial2.available()) Serial2.read();
                if (espnow_rxbuf_head != espnow_rxbuf_tail) {
                    char found_str[20];
                    snprintf(found_str, sizeof(found_str), "Ch:%d found!", scan_channels[i]);
                    serial_status("Bridge found!", found_str);
                    delay(800);
                    return;
                }
                delay(1);
            }
        }
    }
}

void setup_espnow(void) {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();

    wifi_country_t country = {
        .cc = "EU",
        .schan = 1,
        .nchan = 13,
        .policy = WIFI_COUNTRY_POLICY_MANUAL
    };
    esp_wifi_set_country(&country);
    esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B);

    // ESP-NOW didn't show brownouts at default; keep full power for range.
    WiFi.setTxPower(WIFI_POWER_19_5dBm);

    esp_now_init();
    esp_now_register_recv_cb(espnow_recv_cb);

    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, broadcast_mac, 6);
    esp_now_add_peer(&peer);

    scan_for_bridge();
}


//-------------------------------------------------------
// WiFi event logging (UDP mode)
//-------------------------------------------------------

void wifi_event_handler(WiFiEvent_t ev, WiFiEventInfo_t info) {
    switch (ev) {
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            Serial.println("[wifi] STA_CONNECTED");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            Serial.print("[wifi] GOT_IP ");
            Serial.println(WiFi.localIP());
            break;
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            Serial.print("[wifi] DISCONNECTED reason=");
            Serial.println(info.wifi_sta_disconnected.reason);
            break;
        default:
            break;
    }
}


//-------------------------------------------------------
// UDP bring-up
//-------------------------------------------------------

void setup_udp(void) {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    delay(50);

    WiFi.persistent(true);
    WiFi.setAutoReconnect(true);

    // Force 802.11b (flatter TX envelope, matches the ESP-NOW path) and
    // use the maximum 19.5 dBm TX power. The earlier brownout we saw on
    // the Crossbow 5 V rail can return at this power level - use USB or a
    // dedicated UBEC for the ESP32 if that's an issue.
    esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B);
    WiFi.setTxPower(WIFI_POWER_19_5dBm);

    char l2[40];
    snprintf(l2, sizeof(l2), "SSID:%s", WIFI_SSID);
    serial_status("Connecting...", l2);

    WiFi.begin(WIFI_SSID, WIFI_PASS);

    unsigned long t0 = millis();
    int dots = 0;
    while (WiFi.status() != WL_CONNECTED) {
        delay(250);
        char prog[24];
        snprintf(prog, sizeof(prog), "Connecting%.*s", (dots % 4) + 1, "....");
        serial_status(prog, l2);
        dots++;

        if (millis() - t0 > 15000) {
            serial_status("WiFi timeout", "retrying...");
            delay(800);
            WiFi.disconnect();
            delay(200);
            WiFi.begin(WIFI_SSID, WIFI_PASS);
            t0 = millis();
        }
    }

