erwinquilloy/MLRS-GCS-Bridge/mlrs_gcs_esp32_v2/mlrs_gcs_esp32_v2.ino
    int udp_ok = udp.begin(UDP_PORT);
    Serial.print("[udp] begin(");
    Serial.print(UDP_PORT);
    Serial.print(") -> ");
    Serial.println(udp_ok);

    IPAddress ip = WiFi.localIP();
    IPAddress gw = WiFi.gatewayIP();
    Serial.print("[udp] me=");      Serial.print(ip);
    Serial.print(" gateway=");      Serial.print(gw);
    Serial.print(" mask=");         Serial.println(WiFi.subnetMask());

    char l1[32], l2b[32];
    snprintf(l1, sizeof(l1), "IP:%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
    snprintf(l2b, sizeof(l2b), "UDP:%d waiting", UDP_PORT);
    serial_status(l1, l2b);
}


//-------------------------------------------------------
// Boot splash + mode toggle (Serial only)
//
// No OLED, so the countdown prints to Serial. Hold the
// BOOT/PRG button (GPIO0) for the entire window to toggle.
//-------------------------------------------------------

void splash_and_maybe_toggle() {
    pinMode(PRG_PIN, INPUT_PULLUP);

    Serial.println();
    Serial.println("---- mLRS GCS Bridge (ESP32) ----");
    Serial.printf("Mode: %s\n", mode_str(current_mode));
    Serial.println("Hold BOOT/PRG for whole countdown to swap mode.");

    unsigned long t0 = millis();
    bool held_all_along = true;
    bool any_press_seen = false;
    unsigned long last_print = 0;

    while (millis() - t0 < SPLASH_MS) {
        bool pressed = (digitalRead(PRG_PIN) == LOW);
        if (pressed) any_press_seen = true;
        else         held_all_along = false;

        unsigned long now = millis();
        if (now - last_print >= 500) {
            last_print = now;
            unsigned long remaining = SPLASH_MS - (now - t0);
            Serial.printf("Boot in %lus%s\n",
                (remaining + 999) / 1000,
                pressed ? "  [PRG held]" : "");
        }
        delay(20);
    }

    if (any_press_seen && held_all_along) {
        Mode next = (current_mode == MODE_UDP) ? MODE_ESPNOW : MODE_UDP;
        prefs.begin("mlrs", false);
        prefs.putUChar("mode", (uint8_t)next);
        prefs.end();

        Serial.println("Mode toggled.");
        Serial.printf("Next: %s\n", mode_str(next));
        Serial.println("Rebooting...");
        delay(800);
        ESP.restart();
    }
    Serial.println("---- starting bridge ----");
}


//-------------------------------------------------------
// setup() and loop()
//-------------------------------------------------------

void setup() {
    Serial.begin(115200);
    delay(200);

    Serial.println();
    Serial.print("[boot] reset_reason=");
    Serial.print((int)esp_reset_reason());
    Serial.print(" (");
    Serial.print(reset_reason_str(esp_reset_reason()));
    Serial.println(")");
    Serial.print("[boot] free_heap=");
    Serial.println(ESP.getFreeHeap());

    // Load persisted mode (default UDP on fresh flash).
    prefs.begin("mlrs", true);
    current_mode = (Mode)prefs.getUChar("mode", (uint8_t)MODE_UDP);
    prefs.end();
    Serial.print("[boot] mode=");
    Serial.println(mode_str(current_mode));

    WiFi.onEvent(wifi_event_handler);

    splash_and_maybe_toggle();

    // TX only - if your hardware has a back-channel from the Crossbow you
    // can wire a real RX pin here and uplink will start flowing.
    Serial2.begin(CROSSBOW_BAUD, SERIAL_8N1, -1, TX_PIN);

    // Common reset
    espnow_rxbuf_head = 0;
    espnow_rxbuf_tail = 0;
    espnow_latched_mac_available = false;
    latched_peer_added    = false;
    udp_peer_latched      = false;
    is_connected          = false;
    is_connected_tlast_ms = 0;
    link_initialized      = false;
}


// ----------------- ESP-NOW loop tick -----------------

void loop_espnow(unsigned long tnow_ms) {
    // Connection timeout
    if (is_connected && (tnow_ms - is_connected_tlast_ms > 2000)) {
        is_connected = false;
        telem_gps_ok = false;
        scan_for_bridge();
    }

    // Drain ESP-NOW buffer
    int len = espnow_rxbuf_pop(buf, sizeof(buf));
    if (len > 0) {
        Serial2.write(buf, len);

        MavPacket pkt;
        for (int i = 0; i < len; i++) {
            pkt.valid = false;
            if (mav_parse_byte(buf[i], pkt)) {
                process_mavlink_packet(pkt);
            }
        }

        is_connected = true;
        is_connected_tlast_ms = tnow_ms;
    }

    // Register latched peer for uplink
    if (espnow_latched_mac_available && !latched_peer_added) {
        esp_now_peer_info_t lpeer = {};
        memcpy(lpeer.peer_addr, espnow_latched_mac, 6);
        esp_now_add_peer(&lpeer);
        latched_peer_added = true;
    }

    // Uplink: Crossbow -> ESP-NOW -> vehicle
    int rlen = 0;
    while (Serial2.available() && rlen < (int)sizeof(buf)) {
        buf[rlen++] = Serial2.read();
    }
    if (rlen > 0) {
        uint8_t* dest = espnow_latched_mac_available ?
                        espnow_latched_mac : broadcast_mac;
        esp_now_send(dest, buf, rlen);
    }
}


// ----------------- UDP loop tick -----------------

void loop_udp(unsigned long tnow_ms) {
    static unsigned long wifi_down_t0 = 0;
    if (WiFi.status() != WL_CONNECTED) {
        if (wifi_down_t0 == 0) wifi_down_t0 = tnow_ms;
        if (tnow_ms - wifi_down_t0 > 3000) {
            udp.stop();
            udp_peer_latched = false;
            is_connected    = false;
            telem_gps_ok    = false;
            link_initialized = false;
            wifi_down_t0    = 0;
        }
        return;
    }
    wifi_down_t0 = 0;

    if (is_connected && (tnow_ms - is_connected_tlast_ms > 2000)) {
        is_connected = false;
        telem_gps_ok = false;
        serial_status("UDP idle", "waiting...");
    }

    // Downlink
    while (true) {
        int psize = udp.parsePacket();
        if (psize <= 0) break;

        IPAddress src_ip = udp.remoteIP();
        uint16_t  src_pt = udp.remotePort();

        if (!udp_peer_latched) {
            udp_peer_ip      = src_ip;
            udp_peer_port    = src_pt;
            udp_peer_latched = true;
        }

        int len = udp.read(buf, sizeof(buf));
        if (len <= 0) break;

        Serial2.write(buf, len);

        MavPacket pkt;
        for (int i = 0; i < len; i++) {
            pkt.valid = false;
            if (mav_parse_byte(buf[i], pkt)) {
                process_mavlink_packet(pkt);
            }
        }

        is_connected          = true;
        is_connected_tlast_ms = tnow_ms;
    }

