erwinquilloy/MLRS-GCS-Bridge/mlrs_gcs_esp32_v2/mlrs_gcs_esp32_v2.ino
    // Uplink
    int rlen = 0;
    while (Serial2.available() && rlen < (int)sizeof(buf)) {
        buf[rlen++] = Serial2.read();
    }
    if (rlen > 0 && udp_peer_latched) {
        udp.beginPacket(udp_peer_ip, udp_peer_port);
        udp.write(buf, rlen);
        udp.endPacket();
    }

    // Presence ping: keep us in the mLRS bridge's UDP client list so it
    // unicasts downlink to us even after another GCS registers.
    //
    // Destination preference:
    //   1. latched peer IP (after we've received anything once),
    //   2. gateway IP from DHCP,
    //   3. .1 host on our /24 subnet - mLRS doesn't always advertise a
    //      gateway, and without it WiFi.gatewayIP() returns 0.0.0.0
    //      which would silently skip the ping.
    static unsigned long ping_t = 0;
    static bool ping_logged = false;
    if (tnow_ms - ping_t >= 1000) {
        ping_t = tnow_ms;
        IPAddress dest;
        if (udp_peer_latched) {
            dest = udp_peer_ip;
        } else {
            dest = WiFi.gatewayIP();
            if (dest[0] == 0) {
                IPAddress me = WiFi.localIP();
                dest = IPAddress(me[0], me[1], me[2], 1);
            }
        }
        if (dest[0] != 0) {
            if (!ping_logged) {
                Serial.print("[udp] presence_ping -> ");
                Serial.print(dest);
                Serial.println(" (MAVLink HEARTBEAT)");
                ping_logged = true;
            }
            static uint8_t hb_seq = 0;
            uint8_t hb[17];
            int hblen = build_gcs_heartbeat(hb, hb_seq++);
            udp.beginPacket(dest, UDP_PORT);
            udp.write(hb, hblen);
            udp.endPacket();
        }
    }
}


// ----------------- main loop -----------------

void loop() {
    if (!link_initialized) {
        link_initialized = true;
        if (current_mode == MODE_UDP) setup_udp();
        else                          setup_espnow();
        return;
    }

    unsigned long tnow_ms = millis();

    if (current_mode == MODE_UDP) loop_udp(tnow_ms);
    else                          loop_espnow(tnow_ms);

    // Heap / WiFi snapshot every 5 s
    static unsigned long heap_t = 0;
    if (tnow_ms - heap_t >= 5000) {
        heap_t = tnow_ms;
        Serial.print("[heap] free=");
        Serial.print(ESP.getFreeHeap());
        Serial.print(" min=");
        Serial.print(ESP.getMinFreeHeap());
        Serial.print(" mode=");
        Serial.print(mode_str(current_mode));
        if (current_mode == MODE_UDP) {
            Serial.print(" wifi=");
            Serial.print(WiFi.status() == WL_CONNECTED ? "OK" : "DOWN");
            Serial.print(" rssi=");
            Serial.println(WiFi.RSSI());
        } else {
            Serial.println();
        }
    }

    // Serial status refresh
    static unsigned long status_t = 0;
    if (tnow_ms - status_t >= STATUS_UPDATE_MS) {
        status_t = tnow_ms;
        if (is_connected) {
            serial_telem();
        } else {
            if (current_mode == MODE_UDP) {
                char l1[32], l2[32];
                IPAddress ip = WiFi.localIP();
                snprintf(l1, sizeof(l1), "IP:%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
                snprintf(l2, sizeof(l2), "UDP:%d waiting", UDP_PORT);
                serial_status(l1, l2);
            } else {
                serial_status("Scanning for", "mLRS bridge...");
            }
        }
    }

    delay(2);
}
